Revit 2024 API
StructuralSectionStructuralTees.BoltSpacing Property
 Standard bolt spacing in the flange, in. (mm)
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public double BoltSpacing { get; set; }
Visual Basic
Public Property BoltSpacing As Double
	Get
	Set
Visual C++
public:
property double BoltSpacing {
	double get ();
	void set (double value);
}
See Also
StructuralSectionStructuralTees Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace